[
  {
    "text": "A very unusual time period.",
    "start": "0:00.97"
  },
  {
    "text": "The celebrated science fiction author and chemistry professor Isaac Asimov",
    "start": "0:03.34"
  },
  {
    "text": "once cataloged a history of inventions and scientific discoveries",
    "start": "0:07.31"
  },
  {
    "text": "throughout all of human history.",
    "start": "0:10.58"
  },
  {
    "text": "While incomplete, his efforts still reveal something intriguing",
    "start": "0:12.21"
  },
  {
    "text": "about our current era.",
    "start": "0:15.31"
  },
  {
    "text": "Out of the 694 pages in Asimov's book,",
    "start": "0:16.58"
  },
  {
    "text": "553 pages documented inventions and discoveries since 1500,",
    "start": "0:19.79"
  },
  {
    "text": "even though his book starts in 4 million BCE.",
    "start": "0:24.72"
  },
  {
    "text": "In other words, throughout human history, most scientific innovation has come",
    "start": "0:27.73"
  },
  {
    "text": "relatively recently, within only the last few hundred years.",
    "start": "0:31.46"
  },
  {
    "text": "Other historical trends paint a similar picture.",
    "start": "0:34.97"
  },
  {
    "text": "For example, here's a chart of world populations since 10,000 B.C.",
    "start": "0:37.50"
  },
  {
    "text": "For nearly all of human history,",
    "start": "0:42.27"
  },
  {
    "text": "up until quite recently, there weren't very many people on Earth.",
    "start": "0:43.98"
  },
  {
    "text": "It took until about 1800 for the population to reach 1 billion people.",
    "start": "0:47.58"
  },
  {
    "text": "And just 200 years later,",
    "start": "0:51.45"
  },
  {
    "text": "a blink of an eye compared to how long our species has been around,",
    "start": "0:53.22"
  },
  {
    "text": "Earth reached 6 billion people.",
    "start": "0:56.22"
  },
  {
    "text": "Economic historian Bradford DeLong attempted to piece together",
    "start": "0:58.49"
  },
  {
    "text": "the total world economic production over the last million years.",
    "start": "1:01.93"
  },
  {
    "text": "By its nature, his reconstruction of the historical data is speculative,",
    "start": "1:05.53"
  },
  {
    "text": "but the rough story it tells is consistent with the aforementioned",
    "start": "1:09.60"
  },
  {
    "text": "historical trends in population and technology.",
    "start": "1:12.70"
  },
  {
    "text": "In the millennia preceding the current era,",
    "start": "1:15.21"
  },
  {
    "text": "economic growth, by which we mean growth in how much valuable stuff humanity",
    "start": "1:17.34"
  },
  {
    "text": "as a whole can produce,",
    "start": "1:21.41"
  },
  {
    "text": "was extremely slow.",
    "start": "1:22.78"
  },
  {
    "text": "Now growth is much faster.",
    "start": "1:24.48"
  },
  {
    "text": "Bradford DeLong's data provides historians a quantitative account",
    "start": "1:26.52"
  },
  {
    "text": "of what they already know from reading narratives written",
    "start": "1:29.92"
  },
  {
    "text": "in the distant past. For nearly all of human history,",
    "start": "1:32.26"
  },
  {
    "text": "people lived similarly to the way their grandparents lived,",
    "start": "1:35.43"
  },
  {
    "text": "unlike what we expect today.",
    "start": "1:38.43"
  },
  {
    "text": "Most people did not see major changes in living standards,",
    "start": "1:40.27"
  },
  {
    "text": "technology, and economic production over their lifetimes.",
    "start": "1:43.60"
  },
  {
    "text": "To be sure, people were aware that empires rose and fell.",
    "start": "1:46.91"
  },
  {
    "text": "Infectious disease ravaged communities and wars were fought.",
    "start": "1:50.11"
  },
  {
    "text": "Individual humans saw profound change in their own lives",
    "start": "1:53.61"
  },
  {
    "text": "through the births and deaths of those they loved,",
    "start": "1:56.98"
  },
  {
    "text": "cultural change, and migration.",
    "start": "1:59.15"
  },
  {
    "text": "But the idea of a qualitatively different mode of life",
    "start": "2:01.19"
  },
  {
    "text": "with electricity, computers, and the prospect of thermonuclear war?",
    "start": "2:04.29"
  },
  {
    "text": "That's all come extremely recently on historical timescales.",
    "start": "2:08.39"
  },
  {
    "text": "As new technologies were developed,",
    "start": "2:12.16"
  },
  {
    "text": "quality of life shot up in various ways. For ten-year-olds,",
    "start": "2:13.90"
  },
  {
    "text": "life expectancy was once under 60 all over the world.",
    "start": "2:17.64"
  },
  {
    "text": "Now, in many nations, a ten-year-old can expect to live to the age of 80.",
    "start": "2:21.14"
  },
  {
    "text": "With progress in automating food production,",
    "start": "2:24.94"
  },
  {
    "text": "fewer people now are required to grow food.",
    "start": "2:27.64"
  },
  {
    "text": "As a result, our time has been freed to pursue different activities,",
    "start": "2:30.03"
  },
  {
    "text": "for example, going to school.",
    "start": "2:33.46"
  },
  {
    "text": "And it's not just technology that changed.",
    "start": "2:35.02"
  },
  {
    "text": "In the past, people took for granted some social institutions that had existed",
    "start": "2:37.06"
  },
  {
    "text": "for thousands of years,",
    "start": "2:40.93"
  },
  {
    "text": "such as the monarchy and chattel slavery. In the midst of the Industrial Revolution,",
    "start": "2:42.23"
  },
  {
    "text": "these institutions began to vanish.",
    "start": "2:46.67"
  },
  {
    "text": "Writing in 1763, the eminent British economist Adam Smith wrote",
    "start": "2:48.94"
  },
  {
    "text": "that slavery, quote: \"Takes place in all societies",
    "start": "2:53.67"
  },
  {
    "text": "at the beginning and proceeds from that tyrannical disposition,",
    "start": "2:56.84"
  },
  {
    "text": "which may almost be said to be natural to mankind.\"",
    "start": "2:59.95"
  },
  {
    "text": "While Adam Smith personally found the practice repugnant,",
    "start": "3:03.18"
  },
  {
    "text": "he nonetheless was pessimistic about the future of slavery,",
    "start": "3:06.15"
  },
  {
    "text": "predicting that, quote: \"It is indeed almost impossible",
    "start": "3:09.39"
  },
  {
    "text": "that it should ever be totally or generally abolished.\"",
    "start": "3:12.72"
  },
  {
    "text": "And yet, mere decades after Adam Smith wrote those lines,",
    "start": "3:15.56"
  },
  {
    "text": "Britain outlawed slavery and launched a campaign",
    "start": "3:18.70"
  },
  {
    "text": "to end the practice in its colonies around the world.",
    "start": "3:21.30"
  },
  {
    "text": "By the end of the 20th century,",
    "start": "3:23.70"
  },
  {
    "text": "every nation in the world had formally abolished slavery.",
    "start": "3:25.44"
  },
  {
    "text": "Another scholar from his era, Thomas Malthus, made a similar blunder.",
    "start": "3:28.61"
  },
  {
    "text": "At the end of the 18th century, Malthus was concerned",
    "start": "3:32.81"
  },
  {
    "text": "by the population growth he saw in his time.",
    "start": "3:35.41"
  },
  {
    "text": "He reasoned that historically, excess population growth had always outstripped",
    "start": "3:37.75"
  },
  {
    "text": "the food supply, leading to famine and mass death.",
    "start": "3:41.82"
  },
  {
    "text": "As a consequence, Malthus predicted that recent high population",
    "start": "3:44.89"
  },
  {
    "text": "growth in England would inevitably result in a catastrophe.",
    "start": "3:47.99"
  },
  {
    "text": "But what might have been true about all the centuries before",
    "start": "3:51.16"
  },
  {
    "text": "the 18th century evidently came to an end",
    "start": "3:53.80"
  },
  {
    "text": "shortly after Malthus's pessimistic prediction.",
    "start": "3:56.09"
  },
  {
    "text": "Historians now recognize that rather than famine becoming more frequent,",
    "start": "3:58.98"
  },
  {
    "text": "food in Britain became more widely available",
    "start": "4:02.97"
  },
  {
    "text": "in the 19th and 20th centuries, despite unprecedented population growth.",
    "start": "4:05.04"
  },
  {
    "text": "What Adam Smith and Thomas Malthus failed to see was that they were living",
    "start": "4:09.25"
  },
  {
    "text": "in the very beginning of a historically atypical time of rapid change,",
    "start": "4:13.12"
  },
  {
    "text": "a period we now refer to as the Industrial Revolution.",
    "start": "4:17.44"
  },
  {
    "text": "The effects of the Industrial Revolution have been dramatic, reshaping",
    "start": "4:20.69"
  },
  {
    "text": "not only how we live, but also our ideas about what to expect in the future.",
    "start": "4:24.00"
  },
  {
    "text": "The 21st century could be much weirder than we imagine.",
    "start": "4:28.94"
  },
  {
    "text": "It's easy to fault historical figures at the time of the Industrial Revolution",
    "start": "4:32.50"
  },
  {
    "text": "for failing to see what was to come in the next few centuries.",
    "start": "4:36.04"
  },
  {
    "text": "But their method of reasoning,",
    "start": "4:39.01"
  },
  {
    "text": "of looking at the past and extrapolating past trends outwards,",
    "start": "4:40.48"
  },
  {
    "text": "is something we still commonly do today to gauge our expectations of the future.",
    "start": "4:43.85"
  },
  {
    "text": "In the last several decades, society has become accustomed to the global",
    "start": "4:48.05"
  },
  {
    "text": "economy growing at a steady rate of about 2% to 4% per year.",
    "start": "4:51.66"
  },
  {
    "text": "When people imagine the future,",
    "start": "4:55.56"
  },
  {
    "text": "they often implicitly extrapolate this rate of change continuing indefinitely.",
    "start": "4:57.13"
  },
  {
    "text": "We can call this perspective \"business as usual\"",
    "start": "5:01.20"
  },
  {
    "text": "- the idea that change in the coming decades will look more or less like change",
    "start": "5:03.94"
  },
  {
    "text": "in the last few decades.",
    "start": "5:07.74"
  },
  {
    "text": "Under business as usual, the world in 50 years",
    "start": "5:09.21"
  },
  {
    "text": "looks a lot like our current world, but with some modifications.",
    "start": "5:11.91"
  },
  {
    "text": "The world in 2072 would look just about as strange",
    "start": "5:14.88"
  },
  {
    "text": "as someone from 1972 looking at our current world.",
    "start": "5:18.32"
  },
  {
    "text": "Which is to say there will be more technology, different ways of",
    "start": "5:21.52"
  },
  {
    "text": "communicating and socializing with others, distinct popular social movements",
    "start": "5:24.79"
  },
  {
    "text": "and novel economic circumstances, but nothing too out of the ordinary",
    "start": "5:28.83"
  },
  {
    "text": "like the prospect of mind uploading or building Dyson spheres around the sun.",
    "start": "5:32.73"
  },
  {
    "text": "Parents sometimes take this perspective when imagining what life will one day",
    "start": "5:37.20"
  },
  {
    "text": "be like for their children.",
    "start": "5:40.47"
  },
  {
    "text": "Policymakers often take this perspective when crafting policy",
    "start": "5:42.01"
  },
  {
    "text": "so that their proposed rules will be robust to new developments in the future.",
    "start": "5:45.18"
  },
  {
    "text": "And workers who save for their retirement often",
    "start": "5:49.04"
  },
  {
    "text": "take this perspective when they prepare for the challenges of growing old.",
    "start": "5:51.22"
  },
  {
    "text": "Contrast business as usual with another perspective,",
    "start": "5:54.39"
  },
  {
    "text": "which we can call \"the radical change thesis.\"",
    "start": "5:57.29"
  },
  {
    "text": "Perhaps like Adam Smith and Thomas Malthus in their time,",
    "start": "5:59.89"
  },
  {
    "text": "we are failing to see something really big on the horizon.",
    "start": "6:02.83"
  },
  {
    "text": "Under the radical change thesis,",
    "start": "6:05.83"
  },
  {
    "text": "the world by the end of the 21st century will look so different",
    "start": "6:07.60"
  },
  {
    "text": "as to make it almost unrecognizable to people living today.",
    "start": "6:10.67"
  },
  {
    "text": "Technologies that might seem unimaginable to us now, like advanced nanotechnology,",
    "start": "6:13.81"
  },
  {
    "text": "cures for aging, interstellar spaceflight, and fully realistic virtual reality,",
    "start": "6:18.38"
  },
  {
    "text": "could only be a few decades away,",
    "start": "6:22.95"
  },
  {
    "text": "as opposed to many centuries or thousands of years away.",
    "start": "6:24.81"
  },
  {
    "text": "It's sensible to be skeptical of the radical change thesis.",
    "start": "6:27.95"
  },
  {
    "text": "Scientific research happens slowly, and there's even some evidence",
    "start": "6:31.26"
  },
  {
    "text": "that the rate of technological progress has slowed down in recent decades.",
    "start": "6:34.39"
  },
  {
    "text": "At the same time, the radical change thesis makes intuitive sense",
    "start": "6:37.96"
  },
  {
    "text": "from a long view perspective.",
    "start": "6:41.40"
  },
  {
    "text": "Recall the trend in economic growth.",
    "start": "6:43.30"
  },
  {
    "text": "Here, we've zoomed in on the last hundred years of economic growth.",
    "start": "6:45.40"
  },
  {
    "text": "This view justifies the business as usual perspective.",
    "start": "6:48.74"
  },
  {
    "text": "In the last 100 years, economic production and technology",
    "start": "6:51.74"
  },
  {
    "text": "underlying economic production has grown at a fairly constant rate.",
    "start": "6:55.31"
  },
  {
    "text": "Given the regularity of economic growth in recent decades,",
    "start": "6:58.95"
  },
  {
    "text": "it makes a lot of sense to expect that affairs will continue to change",
    "start": "7:01.72"
  },
  {
    "text": "at the current rate for the foreseeable future.",
    "start": "7:04.79"
  },
  {
    "text": "But now zoom out.",
    "start": "7:07.13"
  },
  {
    "text": "What we see is not the regular and predictable trend we saw before,",
    "start": "7:08.93"
  },
  {
    "text": "but something far more dynamic and uncertain.",
    "start": "7:12.06"
  },
  {
    "text": "And rather than looking like change is about to slow down,",
    "start": "7:14.60"
  },
  {
    "text": "it looks more likely that change will continue to speed up.",
    "start": "7:17.27"
  },
  {
    "text": "In a classic 1993 paper, economist Michael Kremer",
    "start": "7:20.07"
  },
  {
    "text": "proposed that the best fit to this long-run economic data",
    "start": "7:23.58"
  },
  {
    "text": "is not the familiar slow rate of exponential change that we're used to,",
    "start": "7:26.61"
  },
  {
    "text": "but rather what's called hyperbolic growth.",
    "start": "7:30.15"
  },
  {
    "text": "Over a long enough time horizon,",
    "start": "7:32.94"
  },
  {
    "text": "hyperbolic growth is much more dramatic than exponential growth,",
    "start": "7:34.62"
  },
  {
    "text": "making it consistent with the radical change thesis.",
    "start": "7:37.86"
  },
  {
    "text": "But it can also be a bit counterintuitive for people to imagine.",
    "start": "7:40.33"
  },
  {
    "text": "So here's an analogy.",
    "start": "7:43.46"
  },
  {
    "text": "Imagine a pile of gold that spontaneously grows over the course of a day.",
    "start": "7:45.20"
  },
  {
    "text": "This pile of gold represents the total size of the",
    "start": "7:49.33"
  },
  {
    "text": "world economy over time,",
    "start": "7:51.82"
  },
  {
    "text": "which we assume grows hyperbolically.",
    "start": "7:53.47"
  },
  {
    "text": "At 12 a.m., the beginning of the day,",
    "start": "7:55.76"
  },
  {
    "text": "there's only one piece of gold in the pile.",
    "start": "7:57.94"
  },
  {
    "text": "After 12 hours, the gold pile doubles in size so that there are now two pieces.",
    "start": "8:00.21"
  },
  {
    "text": "Then at 6 p.m., there are four gold pieces.",
    "start": "8:05.38"
  },
  {
    "text": "Three hours later, at 9 p.m., there are eight gold pieces.",
    "start": "8:08.89"
  },
  {
    "text": "And only one and a half hours after that, at 10:30 p.m.,",
    "start": "8:12.59"
  },
  {
    "text": "there are 16 gold pieces.",
    "start": "8:16.06"
  },
  {
    "text": "From the perspective of someone watching at 10:30 p.m.,",
    "start": "8:18.16"
  },
  {
    "text": "it would be tempting to think that growth over the next few hours will be similar",
    "start": "8:20.90"
  },
  {
    "text": "to growth in the last few hours,",
    "start": "8:24.20"
  },
  {
    "text": "and that by midnight the next day, an hour and a half later,",
    "start": "8:25.81"
  },
  {
    "text": "the gold pile will double in size yet again to 32 pieces.",
    "start": "8:28.91"
  },
  {
    "text": "But this intuition would be wrong.",
    "start": "8:32.51"
  },
  {
    "text": "Notice that the time it takes for the gold pile to double in size",
    "start": "8:34.28"
  },
  {
    "text": "cut in half each time the size of the pile doubles.",
    "start": "8:37.73"
  },
  {
    "text": "As midnight draws nearer,",
    "start": "8:40.63"
  },
  {
    "text": "the pile will continue to double in size again and again,",
    "start": "8:42.12"
  },
  {
    "text": "more frequently each time than the last.",
    "start": "8:45.13"
  },
  {
    "text": "In fact, exactly at midnight, the pile will reach",
    "start": "8:47.46"
  },
  {
    "text": "what's called a singularity and grow to be infinitely large.",
    "start": "8:50.23"
  },
  {
    "text": "We can perform a similar exercise with the real world economy.",
    "start": "8:53.93"
  },
  {
    "text": "In 2020, David Roodman found that after fitting a hyperbolic function",
    "start": "8:57.41"
  },
  {
    "text": "to historical economic data,",
    "start": "9:01.01"
  },
  {
    "text": "the economy is expected to grow to be infinitely large",
    "start": "9:02.85"
  },
  {
    "text": "as we approach roughly the year 2047.",
    "start": "9:06.01"
  },
  {
    "text": "A general result, he says, is fairly robust",
    "start": "9:08.91"
  },
  {
    "text": "to extrapolating the trend at different periods in history.",
    "start": "9:11.25"
  },
  {
    "text": "Now it's important not to take this headline",
    "start": "9:14.45"
  },
  {
    "text": "result too seriously, especially the specific year 2047.",
    "start": "9:16.32"
  },
  {
    "text": "Physical resource limits prohibit the economy from becoming",
    "start": "9:20.36"
  },
  {
    "text": "infinitely large, and moreover, long-run historical data is notoriously unreliable.",
    "start": "9:23.03"
  },
  {
    "text": "Using historical statistics alone, especially those from the distant past,",
    "start": "9:28.27"
  },
  {
    "text": "it's very difficult to predict what the future will really be like.",
    "start": "9:32.04"
  },
  {
    "text": "The business as usual perspective might still be correct",
    "start": "9:35.31"
  },
  {
    "text": "for the foreseeable future, or something else entirely might happen.",
    "start": "9:37.84"
  },
  {
    "text": "Maybe civilization itself will collapse",
    "start": "9:41.31"
  },
  {
    "text": "as we become consigned to fighting endless wars, famines, and pandemics.",
    "start": "9:43.41"
  },
  {
    "text": "Humanity might even go extinct.",
    "start": "9:46.95"
  },
  {
    "text": "These possibilities notwithstanding, there do exist",
    "start": "9:48.96"
  },
  {
    "text": "concrete reasons to think that the world could be fundamentally different",
    "start": "9:51.66"
  },
  {
    "text": "by the end of the 21st century, in a way consistent with the radical change thesis.",
    "start": "9:54.79"
  },
  {
    "text": "Infinite growth is out of the question,",
    "start": "9:59.23"
  },
  {
    "text": "but one technology is clearly visible on the horizon",
    "start": "10:01.20"
  },
  {
    "text": "which arguably has the potential to change our civilization dramatically.",
    "start": "10:04.20"
  },
  {
    "text": "\"The Duplicator\"",
    "start": "10:08.64"
  },
  {
    "text": "Before we try to predict what technology in the coming decades could precipitate",
    "start": "10:10.21"
  },
  {
    "text": "explosive economic growth,",
    "start": "10:14.01"
  },
  {
    "text": "let's first start by examining a hypothetical example",
    "start": "10:15.78"
  },
  {
    "text": "- a technology that would be sufficient to have such an effect.",
    "start": "10:18.85"
  },
  {
    "text": "The machine is the Duplicator from the comic Calvin and Hobbes.",
    "start": "10:22.09"
  },
  {
    "text": "Here's how it works: When someone steps in,",
    "start": "10:25.86"
  },
  {
    "text": "two exact replicas step out.",
    "start": "10:28.36"
  },
  {
    "text": "The replicas keep all of the memories, personalities, and talents of the original.",
    "start": "10:30.63"
  },
  {
    "text": "Basically, it splits you into two people, each of whom remember an identical past.",
    "start": "10:34.67"
  },
  {
    "text": "To constrain our expectations a bit,",
    "start": "10:39.04"
  },
  {
    "text": "let's imagine that using the Duplicator isn't free.",
    "start": "10:40.97"
  },
  {
    "text": "We can only use it to replicate people,",
    "start": "10:43.91"
  },
  {
    "text": "and it costs a lot of money to build and operate a Duplicator.",
    "start": "10:45.88"
  },
  {
    "text": "Yet even with these constraints, it seems safe to assume",
    "start": "10:49.01"
  },
  {
    "text": "that the Duplicator would have a very large impact on the world.",
    "start": "10:51.95"
  },
  {
    "text": "Even without knowing exactly how it will be used, there will presumably",
    "start": "10:55.02"
  },
  {
    "text": "be people who want to use the Duplicator to clone themselves and other people.",
    "start": "10:58.52"
  },
  {
    "text": "Unlike with ordinary population growth, in which it takes 18 years",
    "start": "11:02.33"
  },
  {
    "text": "and a considerable amount of effort to create one productive worker,",
    "start": "11:05.66"
  },
  {
    "text": "the Duplicator would allow us to create productive humans almost instantly",
    "start": "11:08.77"
  },
  {
    "text": "and without having to pay the costs of educating and raising them.",
    "start": "11:12.37"
  },
  {
    "text": "Consider the case of scientific innovation.",
    "start": "11:15.31"
  },
  {
    "text": "If we could clone our most productive scientists",
    "start": "11:17.41"
  },
  {
    "text": "- say Newton, Galileo, or von Neumann",
    "start": "11:20.08"
  },
  {
    "text": "- just imagine how much faster our civilization could innovate.",
    "start": "11:22.78"
  },
  {
    "text": "And it's not just raw scientific innovation that could increase.",
    "start": "11:25.95"
  },
  {
    "text": "With a machine that can duplicate people, all industries could benefit.",
    "start": "11:29.12"
  },
  {
    "text": "The most talented rocket engineers, for example, could be cloned",
    "start": "11:32.49"
  },
  {
    "text": "and directly planted into places where they're needed the most.",
    "start": "11:35.29"
  },
  {
    "text": "And we could duplicate the most talented doctors, musicians, and architects.",
    "start": "11:38.13"
  },
  {
    "text": "As a consequence, the Duplicator would lift",
    "start": "11:42.03"
  },
  {
    "text": "a crucial bottleneck to civilization-wide output.",
    "start": "11:44.17"
  },
  {
    "text": "Unless we impose some strict controls on how often people could use the Duplicator,",
    "start": "11:47.27"
  },
  {
    "text": "it appears likely that there would be a population explosion.",
    "start": "11:51.31"
  },
  {
    "text": "But more than just a population explosion, it would be a productivity explosion,",
    "start": "11:54.21"
  },
  {
    "text": "since the new duplicates",
    "start": "11:58.32"
  },
  {
    "text": "could be direct copies of the most productive people on Earth,",
    "start": "11:59.52"
  },
  {
    "text": "who in turn would use their talents to invent even more productive",
    "start": "12:02.52"
  },
  {
    "text": "technologies and potentially even better duplicators.",
    "start": "12:05.49"
  },
  {
    "text": "Would the Duplicator be enough",
    "start": "12:08.87"
  },
  {
    "text": "to sustain the hyperbolic growth trend in gross world product",
    "start": "12:10.20"
  },
  {
    "text": "and enable us to approach the economic singularity",
    "start": "12:13.46"
  },
  {
    "text": "we discussed earlier?",
    "start": "12:15.53"
  },
  {
    "text": "Maybe.",
    "start": "12:16.84"
  },
  {
    "text": "In academic models of economic growth, there are roughly three inputs",
    "start": "12:17.65"
  },
  {
    "text": "to economic production that determine the overall size of the economy.",
    "start": "12:21.11"
  },
  {
    "text": "These inputs are: population, capital, and technology.",
    "start": "12:24.73"
  },
  {
    "text": "Population is the most intuitive input",
    "start": "12:29.58"
  },
  {
    "text": "- it just means how many workers there are in a society.",
    "start": "12:31.85"
  },
  {
    "text": "Capital is another term for equipment and supplies",
    "start": "12:34.95"
  },
  {
    "text": "like machines, roads, and buildings that allow workers to produce stuff.",
    "start": "12:38.16"
  },
  {
    "text": "Technology is what joins these two inputs together.",
    "start": "12:42.33"
  },
  {
    "text": "It refers to the inherent efficiency of labor and includes",
    "start": "12:45.30"
  },
  {
    "text": "the quality of tools and the knowledge of how to create stuff in the first place.",
    "start": "12:48.57"
  },
  {
    "text": "A simple model of economic growth is the following:",
    "start": "12:52.34"
  },
  {
    "text": "Over time, people have children and the population gets larger.",
    "start": "12:54.74"
  },
  {
    "text": "With more people, the economy also grows.",
    "start": "12:58.08"
  },
  {
    "text": "But the economy also grows faster than the population because people work",
    "start": "13:00.58"
  },
  {
    "text": "to accumulate new capital and invent new technology",
    "start": "13:04.15"
  },
  {
    "text": "at the same time the population is growing.",
    "start": "13:07.22"
  },
  {
    "text": "Most importantly, people come up with new ideas.",
    "start": "13:09.25"
  },
  {
    "text": "These new ideas are shared with others",
    "start": "13:12.29"
  },
  {
    "text": "and can be used by everyone to increase efficiency.",
    "start": "13:14.19"
  },
  {
    "text": "The process of economic growth looks a lot like a feedback loop.",
    "start": "13:17.03"
  },
  {
    "text": "Start with a set of people.",
    "start": "13:20.33"
  },
  {
    "text": "These people innovate and produce capital, which makes them more productive,",
    "start": "13:21.80"
  },
  {
    "text": "and they also produce resources which enables them to produce more people.",
    "start": "13:25.24"
  },
  {
    "text": "The next generation can rinse and repeat,",
    "start": "13:28.81"
  },
  {
    "text": "with each generation more productive than the last,",
    "start": "13:30.84"
  },
  {
    "text": "not only producing more people but also more stuff per capita.",
    "start": "13:33.31"
  },
  {
    "text": "In the absence of increased economic efficiency,",
    "start": "13:37.32"
  },
  {
    "text": "the population will grow exponentially.",
    "start": "13:39.59"
  },
  {
    "text": "But when the total production per person also increases,",
    "start": "13:41.72"
  },
  {
    "text": "this process implies super-exponential economic growth.",
    "start": "13:45.02"
  },
  {
    "text": "Recall the analogy of the gold pile that grows in size from earlier.",
    "start": "13:48.46"
  },
  {
    "text": "The underlying dynamic is that the gold pile doubles in size every interval,",
    "start": "13:52.10"
  },
  {
    "text": "but the interval in which the pile doubles is not fixed.",
    "start": "13:56.07"
  },
  {
    "text": "Metaphorically, the gold pile becomes more efficient",
    "start": "13:59.07"
  },
  {
    "text": "at doubling in size during each interval,",
    "start": "14:01.48"
  },
  {
    "text": "giving rise to a process much faster than exponential growth.",
    "start": "14:03.74"
  },
  {
    "text": "Many standard models of economic growth",
    "start": "14:07.05"
  },
  {
    "text": "carry the same implication about the world economy.",
    "start": "14:08.97"
  },
  {
    "text": "However, we know our current economy isn't exploding in size",
    "start": "14:11.65"
  },
  {
    "text": "in the way predicted by this simple model.",
    "start": "14:14.88"
  },
  {
    "text": "So, why not?",
    "start": "14:16.86"
  },
  {
    "text": "One reason could be that our population growth is slowing down.",
    "start": "14:18.19"
  },
  {
    "text": "Since the 1960s,",
    "start": "14:21.66"
  },
  {
    "text": "population growth worldwide actually peaked before entering a decline.",
    "start": "14:23.00"
  },
  {
    "text": "Not coincidentally, world economic growth has fallen since that decade.",
    "start": "14:26.93"
  },
  {
    "text": "The underlying reason behind the fall in population growth and economic growth,",
    "start": "14:30.94"
  },
  {
    "text": "also called the \"demographic transition,\" is still a matter of debate.",
    "start": "14:34.77"
  },
  {
    "text": "But regardless of its causes, the effect of the demographic",
    "start": "14:38.65"
  },
  {
    "text": "transition has been that most mainstream economic and population forecasters",
    "start": "14:41.48"
  },
  {
    "text": "do not anticipate explosive growth in the 21st century.",
    "start": "14:45.55"
  },
  {
    "text": "But hypothetically, if something like the Duplicator were invented,",
    "start": "14:48.75"
  },
  {
    "text": "then the potential for explosive growth could return.",
    "start": "14:52.12"
  },
  {
    "text": "The most important invention ever?",
    "start": "14:55.29"
  },
  {
    "text": "It's unlikely that humans will soon build the Duplicator.",
    "start": "14:57.36"
  },
  {
    "text": "What's more likely, however, is the invention",
    "start": "15:00.53"
  },
  {
    "text": "of artificial intelligence that can automate labor.",
    "start": "15:02.63"
  },
  {
    "text": "As with the Duplicator, AI could be copied and used as a worker,",
    "start": "15:05.34"
  },
  {
    "text": "vastly increasing total economic productivity.",
    "start": "15:09.14"
  },
  {
    "text": "In fact, the potential for AI",
    "start": "15:11.88"
  },
  {
    "text": "is even more profound than the Duplicator.",
    "start": "15:13.48"
  },
  {
    "text": "That's because AI has a number of advantages over humans",
    "start": "15:15.65"
  },
  {
    "text": "that could enable it to be far more productive in principle.",
    "start": "15:18.72"
  },
  {
    "text": "These advantages include being able to think faster,",
    "start": "15:21.49"
  },
  {
    "text": "save their current memory state,",
    "start": "15:24.49"
  },
  {
    "text": "copy and transfer themselves across the internet,",
    "start": "15:26.27"
  },
  {
    "text": "make improvements to their own software, and much more.",
    "start": "15:28.63"
  },
  {
    "text": "Under the assumption that the development of AI",
    "start": "15:31.70"
  },
  {
    "text": "will have a similar effect on the long-term future",
    "start": "15:33.67"
  },
  {
    "text": "as the Duplicator hypothetically would,",
    "start": "15:36.00"
  },
  {
    "text": "the question of whether the 21st century will have explosive growth",
    "start": "15:38.10"
  },
  {
    "text": "becomes a question of predicting when AI will arrive.",
    "start": "15:41.94"
  },
  {
    "text": "If advanced AI is indeed invented later this century,",
    "start": "15:45.08"
  },
  {
    "text": "it might mean the 21st century is the most important century in history.",
    "start": "15:48.11"
  },
  {
    "text": "When will advanced AI arrive?",
    "start": "15:52.55"
  },
  {
    "text": "If you've paid any attention to the field of AI in recent years,",
    "start": "15:54.75"
  },
  {
    "text": "you've probably noticed that we've made some startling developments.",
    "start": "15:57.86"
  },
  {
    "text": "In the last ten years,",
    "start": "16:00.86"
  },
  {
    "text": "we've seen the rise of artificial neural networks",
    "start": "16:02.03"
  },
  {
    "text": "that can match human performance in image classification,",
    "start": "16:04.20"
  },
  {
    "text": "generate photorealistic images,",
    "start": "16:06.92"
  },
  {
    "text": "beat the top Go players in the world,",
    "start": "16:08.97"
  },
  {
    "text": "drive cars autonomously,",
    "start": "16:10.96"
  },
  {
    "text": "reach grandmaster level at the real-time strategy game StarCraft 2,",
    "start": "16:12.67"
  },
  {
    "text": "learn how to play Atari games from scratch using only the raw pixel data,",
    "start": "16:16.41"
  },
  {
    "text": "and write rudimentary poetry and fiction stories.",
    "start": "16:20.21"
  },
  {
    "text": "If the next decade is anything like the last,",
    "start": "16:22.95"
  },
  {
    "text": "we're sure to see even more impressive developments in the near-term future.",
    "start": "16:25.35"
  },
  {
    "text": "Looking further,",
    "start": "16:28.99"
  },
  {
    "text": "the holy grail of the field of artificial intelligence",
    "start": "16:29.99"
  },
  {
    "text": "is so-called artificial general intelligence, or AGI",
    "start": "16:32.89"
  },
  {
    "text": "- a system capable of performing",
    "start": "16:37.00"
  },
  {
    "text": "not only narrow tasks like game playing and image classification,",
    "start": "16:38.56"
  },
  {
    "text": "but the entire breadth of tasks that humans are capable of performing.",
    "start": "16:42.30"
  },
  {
    "text": "This would include the ability",
    "start": "16:45.84"
  },
  {
    "text": "to reason abstractly and prove new mathematical theorems,",
    "start": "16:47.07"
  },
  {
    "text": "perform scientific research, write books, and invent new goods and services.",
    "start": "16:50.11"
  },
  {
    "text": "In short, an AGI, if created,",
    "start": "16:55.28"
  },
  {
    "text": "would be at least as useful as a human worker",
    "start": "16:57.35"
  },
  {
    "text": "and would in theory have the ability to automate almost any type of human labor.",
    "start": "16:59.82"
  },
  {
    "text": "We know that AGI is possible in principle because human brains",
    "start": "17:04.16"
  },
  {
    "text": "are already a type of general intelligence created by evolution.",
    "start": "17:07.53"
  },
  {
    "text": "Many cognitive scientists and neuroscientists regularly analogized",
    "start": "17:10.73"
  },
  {
    "text": "the brain to a computer",
    "start": "17:14.33"
  },
  {
    "text": "and believe that everything we do is a consequence of algorithms implicit",
    "start": "17:15.50"
  },
  {
    "text": "in the structure of our biological neural networks within our brains.",
    "start": "17:18.87"
  },
  {
    "text": "Unless the human brain performs literal magic,",
    "start": "17:22.71"
  },
  {
    "text": "then we have good reason to believe that one day",
    "start": "17:25.49"
  },
  {
    "text": "we should be able to replicate its abilities in a computer.",
    "start": "17:27.77"
  },
  {
    "text": "However, knowing that AGI is possible is one thing.",
    "start": "17:30.78"
  },
  {
    "text": "Knowing when it will be developed and deployed in the real world",
    "start": "17:34.09"
  },
  {
    "text": "is another thing entirely.",
    "start": "17:37.02"
  },
  {
    "text": "Since the beginning of their discipline, AI",
    "start": "17:38.69"
  },
  {
    "text": "researchers have experienced notorious difficulty",
    "start": "17:40.63"
  },
  {
    "text": "predicting the future of the field.",
    "start": "17:43.16"
  },
  {
    "text": "In the early days of the 1960s, the field was plagued with over-optimism,",
    "start": "17:44.93"
  },
  {
    "text": "with some prominent researchers declaring that human-like AI",
    "start": "17:49.17"
  },
  {
    "text": "was due within 20 years.",
    "start": "17:52.17"
  },
  {
    "text": "After these predictions failed to come to fruition,",
    "start": "17:53.97"
  },
  {
    "text": "most expectations became more modest.",
    "start": "17:56.28"
  },
  {
    "text": "In the 1980s, the field entered what is now known as an AI winter,",
    "start": "17:58.65"
  },
  {
    "text": "and many researchers became more focused on short-term commercial applications",
    "start": "18:02.55"
  },
  {
    "text": "rather than the long-term goal of creating something that rivals the human brain.",
    "start": "18:06.45"
  },
  {
    "text": "These days, there's a wide variety of opinions",
    "start": "18:10.56"
  },
  {
    "text": "among researchers about when AGI will be developed.",
    "start": "18:12.76"
  },
  {
    "text": "The most comprehensive survey to date was by Grace et al. from 2016.",
    "start": "18:15.76"
  },
  {
    "text": "AI experts were asked when they expected, quote:",
    "start": "18:20.34"
  },
  {
    "text": "\"for any occupation, machines could be built",
    "start": "18:23.39"
  },
  {
    "text": "to carry out the task better and more cheaply than human workers.\"",
    "start": "18:25.50"
  },
  {
    "text": "The median response was the year 2061,",
    "start": "18:28.91"
  },
  {
    "text": "with considerable variation in individual responses.",
    "start": "18:31.61"
  },
  {
    "text": "These results show that most researchers take the possibility",
    "start": "18:34.81"
  },
  {
    "text": "of AGI being developed by the end of the century quite seriously.",
    "start": "18:37.72"
  },
  {
    "text": "However, it is worth noting that responses were very sensitive",
    "start": "18:41.12"
  },
  {
    "text": "to the exact phrasing of the question being asked.",
    "start": "18:44.46"
  },
  {
    "text": "A subset of the researchers were asked when they expect AI to automate",
    "start": "18:47.06"
  },
  {
    "text": "all human labor, and the median guess for that question was the year 2136.",
    "start": "18:50.63"
  },
  {
    "text": "It's clear that a significant",
    "start": "18:56.17"
  },
  {
    "text": "minority of researchers are unconvinced that AGI will arrive any time soon.",
    "start": "18:57.44"
  },
  {
    "text": "To see more about this survey of AI researchers,",
    "start": "19:02.01"
  },
  {
    "text": "check out Rob Miles' video about it on his channel.",
    "start": "19:04.63"
  },
  {
    "text": "...or my channel. Really, I mean",
    "start": "19:07.38"
  },
  {
    "text": "I'm Rob Miles. I do the voice for this channel,",
    "start": "19:09.63"
  },
  {
    "text": "but I also have my own channel, Rob Miles AI.",
    "start": "19:11.88"
  },
  {
    "text": "Anyway...",
    "start": "19:14.02"
  },
  {
    "text": "In general, forecasting when AI will be developed is extremely difficult.",
    "start": "19:15.15"
  },
  {
    "text": "Ideally, we could create a measure that represents",
    "start": "19:19.09"
  },
  {
    "text": "how much progress there has been in the field of artificial intelligence.",
    "start": "19:21.56"
  },
  {
    "text": "Then we could plot that measure on a graph and extrapolate outwards",
    "start": "19:24.86"
  },
  {
    "text": "until we're expected to reach a critical threshold",
    "start": "19:28.50"
  },
  {
    "text": "identified with the development of AGI.",
    "start": "19:31.10"
  },
  {
    "text": "The problem with this approach is that it's",
    "start": "19:33.31"
  },
  {
    "text": "very hard to find a robust measure of progress in AI.",
    "start": "19:34.91"
  },
  {
    "text": "Luckily, a recent report from researcher Ajeya Cotra",
    "start": "19:38.11"
  },
  {
    "text": "takes us part of the way there.",
    "start": "19:41.18"
  },
  {
    "text": "Instead of trying to extrapolate progress in AI directly,",
    "start": "19:42.86"
  },
  {
    "text": "her report tries to estimate when something like AGI might be developed",
    "start": "19:45.92"
  },
  {
    "text": "based on trends in how affordable it is to build increasingly large",
    "start": "19:49.35"
  },
  {
    "text": "AI models trained using increasingly difficult tasks.",
    "start": "19:52.86"
  },
  {
    "text": "We can ground estimates of the needed",
    "start": "19:56.13"
  },
  {
    "text": "size of the models in what she calls biological anchors - estimates from biology",
    "start": "19:57.70"
  },
  {
    "text": "that inform how much computation and effort more generally",
    "start": "20:02.37"
  },
  {
    "text": "will be required to develop software that can do what human brains do.",
    "start": "20:05.74"
  },
  {
    "text": "The result very roughly coincides with the median responses",
    "start": "20:09.58"
  },
  {
    "text": "from the expert survey, predicting that humans will likely develop",
    "start": "20:12.51"
  },
  {
    "text": "AI that can cheaply automate nearly all human labor by the end of the century.",
    "start": "20:15.85"
  },
  {
    "text": "In fact, more likely than not by 2060.",
    "start": "20:20.15"
  },
  {
    "text": "To understand how her model comes to this conclusion,",
    "start": "20:22.92"
  },
  {
    "text": "we need to first get a sense of how current progress in AI",
    "start": "20:25.59"
  },
  {
    "text": "is made.",
    "start": "20:28.36"
  },
  {
    "text": "Ajeya Cotra's report on AI timelines",
    "start": "20:29.63"
  },
  {
    "text": "Since 2012,",
    "start": "20:32.73"
  },
  {
    "text": "the field of AI has been revolutionized by developments in deep learning.",
    "start": "20:33.93"
  },
  {
    "text": "Deep learning involves training large artificial neural networks",
    "start": "20:37.57"
  },
  {
    "text": "to learn tasks using an enormous amount of data",
    "start": "20:40.74"
  },
  {
    "text": "without the aid of hand-crafted rules and heuristics.",
    "start": "20:43.47"
  },
  {
    "text": "And it's been successful at cracking a set of traditionally hard problems",
    "start": "20:46.28"
  },
  {
    "text": "in the field, such as those involving vision and natural language.",
    "start": "20:49.55"
  },
  {
    "text": "One way to visualize deep learning is to imagine a digital brain",
    "start": "20:52.88"
  },
  {
    "text": "called an artificial neural network",
    "start": "20:56.52"
  },
  {
    "text": "that tries a massive amount of trial and error at a given task",
    "start": "20:58.49"
  },
  {
    "text": "- for example, predicting the next character in a sequence of text.",
    "start": "21:01.83"
  },
  {
    "text": "The neural network starts out randomly initialized and so will generate gibberish at first.",
    "start": "21:05.14"
  },
  {
    "text": "During training, however, the neural network will be given a set of problems",
    "start": "21:10.30"
  },
  {
    "text": "and will be asked to provide a solution to each of those problems.",
    "start": "21:14.01"
  },
  {
    "text": "If the neural network solutions are incorrect,",
    "start": "21:17.08"
  },
  {
    "text": "its inner workings are slightly rewired",
    "start": "21:19.21"
  },
  {
    "text": "with the intention of it providing a better answer next time.",
    "start": "21:21.55"
  },
  {
    "text": "Over time, the neural network should become better at the assigned task.",
    "start": "21:24.48"
  },
  {
    "text": "If it does, then we say that it's learning.",
    "start": "21:28.35"
  },
  {
    "text": "In her report, Ajeya Cotra discusses a deep connection",
    "start": "21:30.62"
  },
  {
    "text": "between progress in hardware and progress in AI.",
    "start": "21:33.69"
  },
  {
    "text": "The idea is simple: with greater access to computation,",
    "start": "21:36.86"
  },
  {
    "text": "AI researchers can train larger and more general deep learning models.",
    "start": "21:40.20"
  },
  {
    "text": "In fact, the rise of deep learning in the last decade",
    "start": "21:43.90"
  },
  {
    "text": "has largely been attributed to the falling cost of computation,",
    "start": "21:46.27"
  },
  {
    "text": "especially given progress in graphics processing units, which are used heavily",
    "start": "21:49.27"
  },
  {
    "text": "in AI research.",
    "start": "21:53.05"
  },
  {
    "text": "In a nutshell, Cotra tries to predict when it will become affordable",
    "start": "21:54.31"
  },
  {
    "text": "for companies or governments to train extremely large deep learning models,",
    "start": "21:57.75"
  },
  {
    "text": "with the effect of automating labor",
    "start": "22:01.65"
  },
  {
    "text": "across the wide variety of tasks that humans are capable of learning.",
    "start": "22:03.36"
  },
  {
    "text": "In building this forecast, she makes some assumptions",
    "start": "22:06.83"
  },
  {
    "text": "about our ability to scale deep learning models",
    "start": "22:09.39"
  },
  {
    "text": "to reach human-level performance",
    "start": "22:11.60"
  },
  {
    "text": "and the continued growth in computing hardware over the coming decades.",
    "start": "22:13.20"
  },
  {
    "text": "Over time,",
    "start": "22:16.70"
  },
  {
    "text": "researchers have found increasingly effective deep learning models",
    "start": "22:17.60"
  },
  {
    "text": "that are capable of learning",
    "start": "22:20.81"
  },
  {
    "text": "to perform a wider variety of tasks and more efficiently than before.",
    "start": "22:21.91"
  },
  {
    "text": "It seems plausible that this process will continue until deep learning models",
    "start": "22:26.04"
  },
  {
    "text": "are capable of automating any aspect of human cognition.",
    "start": "22:29.58"
  },
  {
    "text": "Even if future AI is not created via deep learning,",
    "start": "22:32.62"
  },
  {
    "text": "Cotra's model may still be useful because of how it puts",
    "start": "22:35.42"
  },
  {
    "text": "a soft upper bound on when humans will create AGI.",
    "start": "22:38.42"
  },
  {
    "text": "She readily admits that if some more clever",
    "start": "22:41.53"
  },
  {
    "text": "and more efficient paradigm for designing AI than deep learning is discovered,",
    "start": "22:43.93"
  },
  {
    "text": "then the dates predicted by this model may end up being too conservative.",
    "start": "22:47.90"
  },
  {
    "text": "Cotra's model",
    "start": "22:51.70"
  },
  {
    "text": "extrapolates the rate at which progress in computing hardware will continue",
    "start": "22:52.54"
  },
  {
    "text": "and the economy will continue to steadily get larger, making it more feasible",
    "start": "22:56.07"
  },
  {
    "text": "for people to train extremely large deep learning models on very large datasets.",
    "start": "22:59.91"
  },
  {
    "text": "By their nature, deep learning algorithms are extremely data",
    "start": "23:04.28"
  },
  {
    "text": "and computation hungry.",
    "start": "23:07.62"
  },
  {
    "text": "It can often take a lot of money and many gigabytes of training data",
    "start": "23:09.15"
  },
  {
    "text": "for deep learning algorithms to learn tasks that most humans",
    "start": "23:12.42"
  },
  {
    "text": "find relatively easy, like manipulating a Rubik's cube",
    "start": "23:15.26"
  },
  {
    "text": "or spotting simple logical errors in natural language.",
    "start": "23:18.50"
  },
  {
    "text": "This is partly why it has only recently become practically",
    "start": "23:21.50"
  },
  {
    "text": "possible to train neural networks to perform these tasks.",
    "start": "23:24.30"
  },
  {
    "text": "Historically, progress in computing power was extraordinarily rapid.",
    "start": "23:27.47"
  },
  {
    "text": "According to data from William Nordhaus,",
    "start": "23:31.34"
  },
  {
    "text": "between 1950 and 2010, the price of computation dropped by over 100 billion.",
    "start": "23:33.44"
  },
  {
    "text": "Put another way, that means that if you needed to perform a calculation in 1950",
    "start": "23:39.15"
  },
  {
    "text": "that would cost the same amount",
    "start": "23:43.19"
  },
  {
    "text": "as the Apollo program that would later send humans to the moon,",
    "start": "23:44.49"
  },
  {
    "text": "then the equivalent calculation would cost less than $10",
    "start": "23:47.49"
  },
  {
    "text": "using computers in 2010, when adjusted for inflation over the same time period.",
    "start": "23:51.00"
  },
  {
    "text": "Since 2010,",
    "start": "23:55.53"
  },
  {
    "text": "the rate of progress in computing hardware has slowed down",
    "start": "23:56.70"
  },
  {
    "text": "from this spectacular pace, but still continues to improve relatively steadily.",
    "start": "23:59.50"
  },
  {
    "text": "By projecting outwards current trends, we can forecast when various computing",
    "start": "24:03.88"
  },
  {
    "text": "milestones will be reached.",
    "start": "24:07.95"
  },
  {
    "text": "For example, we can predict when it will become affordable to train",
    "start": "24:09.41"
  },
  {
    "text": "a deep learning model with 1 billion petaflops or 1 trillion petaflops.",
    "start": "24:12.12"
  },
  {
    "text": "Of course, simply knowing how much computation will be available in the future",
    "start": "24:16.39"
  },
  {
    "text": "can't tell us how powerful deep learning models will be.",
    "start": "24:20.32"
  },
  {
    "text": "For that, we need to understand the relationship",
    "start": "24:23.23"
  },
  {
    "text": "between the amount of computation used to train a deep learning model",
    "start": "24:25.33"
  },
  {
    "text": "and its performance.",
    "start": "24:28.63"
  },
  {
    "text": "Here's where Ajeya Cotra's model becomes a little tricky.",
    "start": "24:30.10"
  },
  {
    "text": "Roughly speaking, there are two factors that determine how much computation",
    "start": "24:32.90"
  },
  {
    "text": "it takes to train a deep learning model on some task,",
    "start": "24:36.41"
  },
  {
    "text": "holding other factors fixed:",
    "start": "24:39.16"
  },
  {
    "text": "the size of the deep learning model,",
    "start": "24:40.85"
  },
  {
    "text": "and how much trial and error the model needs to learn the task.",
    "start": "24:42.48"
  },
  {
    "text": "Let's consider the first factor - the size of the deep learning model.",
    "start": "24:45.95"
  },
  {
    "text": "Larger models are sort of like larger brains.",
    "start": "24:49.79"
  },
  {
    "text": "They're able to learn more stuff, execute more complex instructions,",
    "start": "24:52.26"
  },
  {
    "text": "and pick up on more nuanced patterns in the world.",
    "start": "24:55.99"
  },
  {
    "text": "In the animal kingdom, we often, but not always,",
    "start": "24:58.86"
  },
  {
    "text": "consider animals with larger brains, such as dogs, to be more generally",
    "start": "25:01.62"
  },
  {
    "text": "intelligent than animals with smaller brains, such as fish.",
    "start": "25:05.47"
  },
  {
    "text": "For many complex tasks, like writing code,",
    "start": "25:08.74"
  },
  {
    "text": "you need a fairly large minimum model size",
    "start": "25:11.18"
  },
  {
    "text": "- perhaps almost the size of a mouse's brain",
    "start": "25:13.63"
  },
  {
    "text": "- to learn the task to any reasonable degree of performance.",
    "start": "25:15.78"
  },
  {
    "text": "And it will still be significantly worse than human programmers.",
    "start": "25:18.58"
  },
  {
    "text": "The task we're most interested in is the task of automating human labor,",
    "start": "25:21.79"
  },
  {
    "text": "at least the key components of human labor most important for advancing science",
    "start": "25:25.69"
  },
  {
    "text": "and technology.",
    "start": "25:29.43"
  },
  {
    "text": "It seems plausible that we'd need to use substantially larger models",
    "start": "25:30.39"
  },
  {
    "text": "than any we've trained so far if we want to train on this task.",
    "start": "25:33.30"
  },
  {
    "text": "Cotra roughly anchors",
    "start": "25:36.87"
  },
  {
    "text": "\"the size of model that would be capable of learning the task of automating R&D\"",
    "start": "25:38.20"
  },
  {
    "text": "with the size of the human brain,",
    "start": "25:42.34"
  },
  {
    "text": "give or take a few orders of magnitude.",
    "start": "25:44.11"
  },
  {
    "text": "In fact, this approach of using biological anchors to guide our AI",
    "start": "25:46.08"
  },
  {
    "text": "forecasts has precedent.",
    "start": "25:49.38"
  },
  {
    "text": "In 1997, the computer scientist Hans Moravec",
    "start": "25:50.98"
  },
  {
    "text": "tried to predict when computer hardware",
    "start": "25:54.62"
  },
  {
    "text": "would become available that would rival the human brain.",
    "start": "25:56.48"
  },
  {
    "text": "Later work by Ray Kurzweil mirrored Moravec's approach.",
    "start": "25:59.02"
  },
  {
    "text": "After looking into these older estimates,",
    "start": "26:02.36"
  },
  {
    "text": "Cotra felt that the loose brain anchor made sense",
    "start": "26:04.36"
  },
  {
    "text": "and seemed broadly consistent with machine learning performance so far.",
    "start": "26:07.12"
  },
  {
    "text": "She ultimately made the guess that current algorithms are about 1/10 as efficient",
    "start": "26:10.50"
  },
  {
    "text": "as the human brain, with very wide uncertainty around this estimate.",
    "start": "26:14.61"
  },
  {
    "text": "Now we come to the second factor:",
    "start": "26:18.34"
  },
  {
    "text": "How much trial and error would a brain-sized model need to learn",
    "start": "26:20.11"
  },
  {
    "text": "tasks required to automate science and technology R&D?",
    "start": "26:23.75"
  },
  {
    "text": "This is the hardest and most uncertain open question in this entire analysis.",
    "start": "26:27.09"
  },
  {
    "text": "How much trial and error is needed to train this model is a question",
    "start": "26:31.32"
  },
  {
    "text": "of how efficient deep learning models will be at learning tasks of this form.",
    "start": "26:34.43"
  },
  {
    "text": "And we only have limited and very indirect evidence about that question.",
    "start": "26:38.53"
  },
  {
    "text": "The possibilities span a wide range.",
    "start": "26:42.33"
  },
  {
    "text": "For example, perhaps deep learning models will be as efficient as human children,",
    "start": "26:44.47"
  },
  {
    "text": "taking only the equivalent of 20 years of experience,",
    "start": "26:48.31"
  },
  {
    "text": "sped up greatly within a computer, to learn how to be a scientist or engineer.",
    "start": "26:51.41"
  },
  {
    "text": "Cotra thinks this is unlikely, but not impossible.",
    "start": "26:55.41"
  },
  {
    "text": "On the other extreme, perhaps deep learning models",
    "start": "26:58.18"
  },
  {
    "text": "will be as inefficient as evolution, taking the equivalent of hundreds",
    "start": "27:00.45"
  },
  {
    "text": "of trillions of lifetimes of experience to evolve into a scientist or engineer.",
    "start": "27:03.89"
  },
  {
    "text": "Again, Cotra thinks this is unlikely but possible.",
    "start": "27:08.49"
  },
  {
    "text": "Cotra thinks the answer is likely to lie somewhere in between",
    "start": "27:11.46"
  },
  {
    "text": "- that training deep learning models to automate science and engineering",
    "start": "27:14.47"
  },
  {
    "text": "will require much more computation than raising a human child to be a scientist,",
    "start": "27:17.67"
  },
  {
    "text": "but much less computation than simulating natural selection",
    "start": "27:21.44"
  },
  {
    "text": "until it evolves scientists.",
    "start": "27:24.51"
  },
  {
    "text": "In her report,",
    "start": "27:26.41"
  },
  {
    "text": "Cotra considers several anchors that lie in between these two extremes",
    "start": "27:27.38"
  },
  {
    "text": "and proceeds by placing a subjective probability distribution over all of them.",
    "start": "27:31.35"
  },
  {
    "text": "She arrived at the prediction that there's a roughly 50% chance that it will become",
    "start": "27:35.39"
  },
  {
    "text": "economically feasible to train the relevant type of advanced AI",
    "start": "27:39.26"
  },
  {
    "text": "by 2052.",
    "start": "27:42.33"
  },
  {
    "text": "The uncertainty in her calculation was quite large, however,",
    "start": "27:43.96"
  },
  {
    "text": "reflecting the uncertainty in her assumptions.",
    "start": "27:46.90"
  },
  {
    "text": "Here's a graph showing how the resulting probability distribution changes",
    "start": "27:49.47"
  },
  {
    "text": "under different assumptions.",
    "start": "27:52.80"
  },
  {
    "text": "What does this all ultimately mean?",
    "start": "27:54.54"
  },
  {
    "text": "Now you might be thinking, let's say these predictions are right.",
    "start": "27:56.64"
  },
  {
    "text": "AGI arrives later this century, and as a result,",
    "start": "27:59.71"
  },
  {
    "text": "there's a productivity explosion changing human life as we know it.",
    "start": "28:02.81"
  },
  {
    "text": "What does it ultimately mean for us?",
    "start": "28:06.28"
  },
  {
    "text": "Should we be excited?",
    "start": "28:08.35"
  },
  {
    "text": "Should we be scared?",
    "start": "28:09.82"
  },
  {
    "text": "At the very least, our expectations should be calibrated",
    "start": "28:11.22"
  },
  {
    "text": "to the magnitude of the event.",
    "start": "28:13.92"
  },
  {
    "text": "If your main concern from AGI is that you might lose your job to a robot,",
    "start": "28:15.66"
  },
  {
    "text": "then your vision of what the future will be like might be too parochial.",
    "start": "28:19.53"
  },
  {
    "text": "If AGI arrives later this century, it could mark a fundamental transformation",
    "start": "28:23.23"
  },
  {
    "text": "in our species,",
    "start": "28:27.27"
  },
  {
    "text": "not merely a societal shift, a new fad, or the invention of a few new gadgets.",
    "start": "28:28.37"
  },
  {
    "text": "As science fiction author Vernor Vinge put it in a famous 1993 essay,",
    "start": "28:33.24"
  },
  {
    "text": "this change will be a throwing away of all the human rules,",
    "start": "28:37.72"
  },
  {
    "text": "perhaps in the blink of an eye,",
    "start": "28:41.15"
  },
  {
    "text": "an exponential runaway beyond any hope of control.",
    "start": "28:42.72"
  },
  {
    "text": "Developments that were thought",
    "start": "28:45.96"
  },
  {
    "text": "might only happen in a million years, if ever,",
    "start": "28:47.19"
  },
  {
    "text": "will likely happen in the next century.",
    "start": "28:50.20"
  },
  {
    "text": "One way of thinking about this event",
    "start": "28:52.36"
  },
  {
    "text": "is to imagine that humanity is on a cliff's edge,",
    "start": "28:54.13"
  },
  {
    "text": "ready to slide off into the abyss.",
    "start": "28:56.91"
  },
  {
    "text": "In the abyss,",
    "start": "28:59.07"
  },
  {
    "text": "we have only the vaguest sense as to what lies beyond.",
    "start": "28:59.74"
  },
  {
    "text": "But we can give our best guesses.",
    "start": "29:02.64"
  },
  {
    "text": "A good guess is that humans, or our descendants,",
    "start": "29:04.48"
  },
  {
    "text": "will colonize the galaxy and beyond.",
    "start": "29:07.11"
  },
  {
    "text": "That means, roughly speaking, the history of life looks a lot like this,",
    "start": "29:09.41"
  },
  {
    "text": "with our present time",
    "start": "29:13.18"
  },
  {
    "text": "tightly packed between the time humans first came into existence",
    "start": "29:14.35"
  },
  {
    "text": "and the time of the first galaxy-wide civilization.",
    "start": "29:17.96"
  },
  {
    "text": "Our future could be extraordinarily vast, filled with technological wonders,",
    "start": "29:21.33"
  },
  {
    "text": "a giant number of people and strange beings,",
    "start": "29:26.00"
  },
  {
    "text": "and forms of social and political organization we can scarcely imagine.",
    "start": "29:28.91"
  },
  {
    "text": "The future could be extremely bright...",
    "start": "29:32.80"
  },
  {
    "text": "or it could be filled with horrors.",
    "start": "29:35.17"
  },
  {
    "text": "One harrowing possibility",
    "start": "29:37.11"
  },
  {
    "text": "is that the development of AGI will be much like the development",
    "start": "29:38.91"
  },
  {
    "text": "of human life on Earth,",
    "start": "29:41.78"
  },
  {
    "text": "which wasn't necessarily so great for the other animals.",
    "start": "29:43.19"
  },
  {
    "text": "The worry here is one of value misalignment.",
    "start": "29:46.58"
  },
  {
    "text": "It is not guaranteed that even though humans will be the ones to develop AI,",
    "start": "29:49.12"
  },
  {
    "text": "that AI will be aligned with human values.",
    "start": "29:53.62"
  },
  {
    "text": "In fact, my channel is about how advanced AI",
    "start": "29:56.36"
  },
  {
    "text": "could turn out to be misaligned with human values,",
    "start": "29:59.13"
  },
  {
    "text": "which could surely lead to bad outcomes.",
    "start": "30:01.63"
  },
  {
    "text": "This prospect raises a variety of technical challenges,",
    "start": "30:03.97"
  },
  {
    "text": "prompting the need for more research on how to make sure future AI",
    "start": "30:07.04"
  },
  {
    "text": "is compatible with human values.",
    "start": "30:10.44"
  },
  {
    "text": "In addition to understanding what's to come,",
    "start": "30:12.48"
  },
  {
    "text": "we also have a responsibility to make sure things go right.",
    "start": "30:14.61"
  },
  {
    "text": "When approaching what may be the most important event in human history,",
    "start": "30:17.95"
  },
  {
    "text": "perhaps the only appropriate emotion is vigilance.",
    "start": "30:21.42"
  },
  {
    "text": "If we are on the edge of a radical transformation of our civilization,",
    "start": "30:24.72"
  },
  {
    "text": "the actions we take today could have profound effects on the long-term future,",
    "start": "30:28.29"
  },
  {
    "text": "reverberating through billions of years of future history.",
    "start": "30:32.69"
  },
  {
    "text": "Even if we're not literally among the most important people who ever live,",
    "start": "30:36.30"
  },
  {
    "text": "our actions may still reach far farther than we might have otherwise expected.",
    "start": "30:39.77"
  },
  {
    "text": "The astronomer Carl Sagan once wrote that Earth is a pale blue dot",
    "start": "30:43.78"
  },
  {
    "text": "suspended in the void of space",
    "start": "30:47.86"
  },
  {
    "text": "whose inhabitants exaggerate their importance.",
    "start": "30:49.91"
  },
  {
    "text": "He asked us to",
    "start": "30:52.98"
  },
  {
    "text": "think of the rivers of blood spilled by all those generals and emperors,",
    "start": "30:54.12"
  },
  {
    "text": "so that in glory and triumph",
    "start": "30:58.02"
  },
  {
    "text": "they could become the momentary masters of a fraction of a dot.",
    "start": "31:00.09"
  },
  {
    "text": "Carl Sagan's intention was to get us to understand",
    "start": "31:04.35"
  },
  {
    "text": "the gravity of our decisions by virtue of our cosmic insignificance.",
    "start": "31:06.70"
  },
  {
    "text": "However, in the light of the fact that the 21st century could be",
    "start": "31:10.80"
  },
  {
    "text": "the most important century in human history,",
    "start": "31:13.77"
  },
  {
    "text": "we can turn this sentiment on its head.",
    "start": "31:16.01"
  },
  {
    "text": "If indeed humans will, sometime in the foreseeable future, reach the stars,",
    "start": "31:18.27"
  },
  {
    "text": "our choices now are cosmically significant,",
    "start": "31:22.61"
  },
  {
    "text": "despite currently only being tiny inhabitants of a pale blue dot.",
    "start": "31:25.36"
  },
  {
    "text": "Right now our civilization is tiny, but we could be the seed",
    "start": "31:29.99"
  },
  {
    "text": "to something that will soon become almost incomprehensibly big",
    "start": "31:33.85"
  },
  {
    "text": "and measured on astronomical scales.",
    "start": "31:37.24"
  },
  {
    "text": "The vast majority of planets and stars could be dead,",
    "start": "31:39.60"
  },
  {
    "text": "but we might fill them with value.",
    "start": "31:42.73"
  },
  {
    "text": "Much of what we might have previously thought impossible this century",
    "start": "31:44.84"
  },
  {
    "text": "may soon become possible.",
    "start": "31:48.23"
  },
  {
    "text": "Truly mind-bending technological and economic change",
    "start": "31:49.87"
  },
  {
    "text": "may all play a role in our lifetimes.",
    "start": "31:53.33"
  },
  {
    "text": "Rather than pondering our unimportance,",
    "start": "31:55.75"
  },
  {
    "text": "perhaps it's wiser to try to understand our true place in history.",
    "start": "31:58.42"
  },
  {
    "text": "And quickly.",
    "start": "32:02.15"
  },
  {
    "text": "There might be only so much time left",
    "start": "32:03.35"
  },
  {
    "text": "before we take the deep plunge into the abyss.",
    "start": "32:05.52"
  }
]